
$( function() {
    
$( ".drag" ).draggable({

    // When the user starts dragging, make sure the z-index for this
    // helper is higher than all other draggables.
    start: function ( e, ui ) {
        $( ".ui-draggable" ).not( ui.helper.css( "z-index", "1" ) )
                            .css( "z-index", "0" );
    }

})

.click(function() {
    $(this).draggable( {disabled: false});
}).dblclick(function() {
    $(this).draggable({ disabled: true });
});


  } );


function randomLeet() {
  //console.log("hi");
  var text = document.getElementById("face").innerHTML;
  //console.log(text);
  var newText = "";
  var bracketFlag = false;
  for (let i=0; i<text.length; i++) {
    var c = text.charAt(i);
    if (c === '<') {
      bracketFlag = true;
    }
    else if (c === '>') {
      bracketFlag = false;
      newText += c;
      continue;
    }

    if (bracketFlag) {
      newText += c;
      continue;
    }

    console.log(c);
    var rand = Math.random() * 200;
    console.log(rand);
    var newC = "<span style='--leet-axis: " + rand + "; font-variation-settings: \"rdct\" var(--leet-axis);'>" + c + "</span>";
    newText+= newC;
  }
  document.getElementById("face").innerHTML = newText;
}




$(document).ready(function(){


	$('input[type=range]').on('input', function(){
		 inputType = $(this).attr('id');
		 inputValue = $(this).val();

		 if (inputType == 'rdct'){
		 	$('#face').css('--leet-axis', inputValue);
		 }else{
		 	$('#face').css('--mouth-axis', inputValue);
		 }

	});

	$('#play').click(function(){
		$('#face').toggleClass('animated');
	});

});
	

$(document).ready(function(){


	$('input[type=range]').on('input', function(){
		 inputType = $(this).attr('id');
		 inputValue = $(this).val();

		 if (inputType == 'leet'){
		 	$('#leet-face').css('--leet-axis', inputValue);
		 }else{
		 	$('#face').css('--mouth-axis', inputValue);
		 }

	});

	$('#play').click(function(){
		$('#face').toggleClass('animated');
	});

});




let Fonts = [["a","а","ₐ","𝖺","ᵃ","𝗮","𝘢","Ƌ","𝚊","𝙖","მ","𝟃","𝐚","ͣ","∂","ƌ","𝞉","ą","ɑ","α","𝝏","⍺","𝝰","𝒂","𝞪","ߥ","ᥑ","ᥲ","𝑎","შ","𝜶","𝛼","ᵅ","𝖆","ລ","𝛂","𝓪","𝜕","@","ạ","á","à","ā","ล"],["b","ხ","ɓ","ᖯ","𝖻","ߕ","𝘣","Ь","ᑲ","ƅ","𝐛","𝗯","ƀ","ᵇ","Ƅ","ƃ","Ъ","Ҍ","␢","ᒃ","Ꮟ","ᵬ","𝙗","ь","𝚋","Ⴆ","Ϧ","Ⱃ","𝖇","𝒃","𝑏","ҍ","ъ","♭","ḃ","ᑳ","ⱃ","Ꙏ","ᑿ","ᕹ","ḅ","𝔟","𝕓"],["C","Ϲ","𝖢","Ⅽ","𝗖","С","c","ϲ","∁","с","𝖼","𝘾","ⅽ","ᑕ","ᴄ","𝘊","ᶜ","𝘤","Ꮯ","Ⲥ","ᑦ","ᒼ","𐒨","𝐜","𝗰","ⲥ","𝙲","𝙘","Ꮳ","𝚌","ⵎ","𝒄","ͨ","𝑐","ç","ᥴ","𝓬","Ͼ","Ċ","⸦","८","ͼ","ᑢ","℃","င","ｃ","ር","🇨","ċ","Ć","ㄷ"],["đ","ɗ","ძ","d","ⅾ","ᑯ","𝖽","ժ","𝘥","𝗱","Ԁ","Ꮷ","ᵈ","𝙙","𝐝","Ժ","𝚍","ͩ","ḑ","𝒅","𝑑","ᵭ","ԁ","𝒹","ⅆ","ᕷ","𝕕","𝛿","𝓭","ḋ","Ԃ","ᑰ","ď","𝛛"],["е","𝖾","ₑ","e","𝘦","ᵉ","𝐞","𝗲","ℯ","𝙚","𝚎","Ә","ə","Ҽ","ɘ","𝟈","ę","ᥱ","𝒆","𝑒","℮","ǝ","ә","𝓮","ᕪ","ᕦ","𝖊","巳","ల","已","୧","ല","ē","é"],["f","𝖿","ƒ","𝗳","ᶠ","⨍","ẝ","𝐟","ẜ","⨎","𝘧","𝙛","𝚏","𝕗","ғ","ᵳ","𝓯","𝖋","𝒇","𝑓","ᶂ","⨏","𝔣","🝡","բ"],["𝗀","ɡ","g","ց","𝗴","𝐠","𝘨","𝒈","ᶢ","ᵍ","𝑔","𝙜","ǥ","Ց","𝚐","გ","𝖌","𝔤","𝓰","ģ","ġ","ဌ","ｇ"],["һ","𝗵","h","Ⴙ","𝗁","Һ","ʰ","𝘩","ħ","ի","ɦ","𝐡","ꜧ","Ꮒ","ₕ","ᑋ","ⱨ","𝚑","𝙝","ℎ","ʱ","ꚕ","Ԧ","ɧ","♄","𐌷","Ꚕ","𝒉","𝕙","ћ","ͪ","ђ","ḣ","ĥ","ḥ","ℏ","ẖ","𝖍","ԧ","ḩ","ȟ","ḫ","Ⴌ","ჩ","ん","𐒅"],["Í","Ī","і","i","Î","İ","𝗂","ⅰ","𝐢","Ǐ","Ꭵ","ℹ","ᵢ","ꜟ","Ì","ꜞ","ī","į","𝖏","Ĭ","וֹ","ɨ","Ῑ","𝗶","ⁱ","𝔦","𝔧","ῑ","Ỉ","𝖎","ﺃ","𝒊","𝚒","𝙞","ἰ","أ","ἱ","ί","Ĩ","ﺄ","ὶ","Ῐ","ĺ","𝑖","î","ῐ","ỉ","𝘪","ĭ","í","ì","ǐ","ί","𝒾","𝓲","ⅈ","Ȋ","ﺂ","ı","Ἰ","讠","༏","ΐ","ï"],["ϳ","ј","𝐣","j","𝗷","𝗃","ʲ","𝘫","ⱼ","𝙟","ʝ","𝕛","ĵ","ȷ","Ì","𝖩","ᒨ","𝑗","⌡","ɉ","𝒋","ﻟ","𝖏","ᒎ","⎭","ᴶ","ﻧ","ǰ","ⅉ","ڵ","𝚓","𝗝","ᶨ","ڶ","𝓳","ڒ","ۯ","ݬ","ᒩ","𝙅","ᒏ","ﮌ","ڑ","ز","𝒿","ᒛ","ᒵ","ᑰ","ᒍ","ﻝ","ل","ᒴ","ﻞ","၂","ژ","ذ"],["𝗸","k","𝗄","𝐤","𝘬","ᵏ","ƙ","𝙠","ĸ","ҟ","ₖ","𝚔","ⱪ","K","K","𝗞","𝖪","𝝟","κ","Κ","к","К","Ꮶ","𝒌","Қ","𝑘","𝐊","𐌊","𝕜","𝙆","₭","Ҝ","𝞙","Ҡ","𝚱","ᴷ","Ƙ","ᴋ","ḱ","𝝹","қ","ǩ","ꝁ","𝘒","ꝃ","Ќ","ķ","ḵ","ḳ","Ḱ","Ǩ","Ꝃ","Ꝁ","Ҟ","ҝ","Ķ","Ⲕ","ќ","𝙺","𝞳","Ԟ","Ḳ","ꝅ","𝛋","Ḵ","ꗪ","Ꝅ","ҡ","𝖐","ᶄ","𝛫","ⲕ","Ϗ","𝜥","Ⱪ","𝕂","🇰"],["┃","I","Ι","І","l","𝐥","Į","▏","Ⲓ","ǀ","ⵏ","ߊ","╵","▕","ᥣ","╽","ꟾ","▎","╿","ꞁ","ɭ","|","ᶅ","ⅼ","⌊","❙","𝗅","⎮","Ӏ","Ⅰ","ا","ﺍ","լ","𐌠","Ɩ","𐌉","𝗹","ﺎ","Ꙇ","৷","𝔩","ι","ɩ","ᶩ","│","⎢","ˡ","⎜","⍳","⎣","❘","└","ꙇ","┕","׀","𝝞","L","ן","⎩","𝚕","ʅ","▐","▌","ӏ","⎟","⎥","𝖑","⎪","ᥨ","∣","꜖","し","𝒍","Լ","𝞘","𝍩","/","ʟ","𝙇","ւ","𝘓","Ⅼ","𝑙","ᒻ","ḻ","𐒃","ᴸ","⸤","ᒐ","⎝","╙","ℓ","⇂","١","౹","।","丨","།","｜","‖","Ί","เ","ŀ","ไ","ľ","ｌ","ㄴ","乚","ㅣ","ட"],["𝗺","m","𝐦","𝗆","𝙢","ⅿ","𝘮","ɱ","𝚖","ᗰ","₥","ᵐ","ന","ₘ","ͫ","𝖒","ጠ","ᶬ","ო","𝕞","ᙏ","ṃ","ᙢ","൩","𝒎","ᵯ","ᘻ","⩋","ᗶ","𝓶","♏","𝑚","𝔪","ጢ","⫙","ṁ","𝓂","ጡ","㎡","ጦ","ጣ","ෆ","㎥"],["n","П","𝝥","𝗇","п","ո","Ŋ","Ⴖ","Ո","Π","∏","𝗻","∩","ᑎ","η","Ꞃ","ⁿ","𝝶","ƞ","⋂","ր","ח","ᴨ","𝐧","ₙ","Ƞ","ɳ","ᥒ","ŋ","ɲ","ﬨ","𝚗","𝞟","𝙣","ռ","𝘯","ת","𝞰","Ռ","𝒏","𝑛","𐌿","ղ","𐍀","Ⲡ","𝖓","𝔫","ი","ᥥ","ꞑ","ᥰ","ῃ","𐒐","ņ","ԉ","ԥ","ᑙ","ṇ","ᑏ","ᑚ","ṉ","𝓷","Ԉ","𝟆","ṅ","ṋ","ŉ","դ","𝛈","በ","תּ","𝜼","ก","ກ","ቢ","ｎ","ቡ"],["О","о","Ο","O","ο","o","𝖮","໐","𝗈","𝗢","𝝤","ₒ","Օ","0","ⵔ","օ","ᴼ","ᴏ","𝘖","𝐎","𝚶","߀","⁰","𝟢","𝟬","𝙊","𝞞","Ơ","ߋ","ᵒ","⭘","⚬","Ⲟ","₀","⭕","𝞸","𝙤","𝝾","𝗼","σ","𐒠","𝛐","૦","௦","𝘰","𝐨","٥","ℴ","ⲟ","𝜪","𝝄","𝑶","θ","𝒐","𝜊","𝑜","𝞂","𝟶","𝛰","𝑂","○","𝞼","Ѻ","𝞱","𝙾","๐","𝚘","𝝧","੦","ഠ","❍","०","⚈","𝝷","◯","𝞡","𝛔","𝛉","ʘ","𝓸","ѻ","ܘ","Ꙩ","Θ","𝖔","𝜃","০","𝜎","ⵀ","ⵙ","Ό","Ф","𝜽","ᴑ","⚉","ዑ","𝝈","ɵ","೦","⊙","◎","๏","ဝ","၀","ס","〇","࿀","ㅇ","０","౦","Ò","☉","Ō","ዐ","ō","⊕","൦","ó","Ө","ò","ㆁ","Ø","ဓ","စ"],["p","р","⍴","𝗉","ᑭ","𝗽","ϸ","ρ","𝐩","𝛒","ꝑ","𝞀","𝘱","þ","ϼ","ᵖ","ₚ","𝙥","𝚙","𝞺","ƥ","ƿ","ᴘ","ᵱ","𝑝","𝒑","𝔭","𝓹","ⲣ","𝕡","𝖕","ᑶ","Ꭾ","ᑮ","ꝓ","ᕶ","ཥ"],["q","ɋ","𝗊","գ","ԛ","զ","Ɋ","ꝗ","𝗾","ᑫ","𝘲","𝐪","𝙦","𝚚","𝒒","𝑞","𝓺","૧","ǫ","ᕴ","ᶐ","੧","٩","۹","৭","𝕢","ᒅ","ꘫ","𝔮","𝚀","ฯ"],["┎","┏","𝝘","𝗿","r","𝗋","⸢","г","┍","ᵣ","ʳ","Г","ɼ","Γ","┌","𝞒","Ꞅ","ᒥ","𝐫","𝚪","ᴦ","𝘳","Ꮁ","ᒋ","ɾ","꜒","ᣘ","𝚛","𝙧","𝜞","⸀","ґ","ɽ","ᣴ","Ⲅ","𝛤","ͬ","𝒓","𝑟","ṛ","ⲅ","ꞃ","𝖗","٢","𝓻","۲","ŗ","Ѓ","ꞅ","୮","「","ŕ"],["s","ѕ","Ѕ","𝖲","Ⴝ","ꜱ","𝗦","ˢ","𝗌","S","Տ","ᔆ","𝘚","𝘴","ₛ","Ꮪ","𝙎","𝘀","𐍃","𝚂","Ꭶ","𝐬","ડ","Ş","ട","ꕶ","𝚜","𝙨","Ꚃ","𐒖","ຣ","Ꮥ","𐒡","ş","ಽ","ʂ","𝒔","ऽ","ᣵ","𝑠","ઽ","ꗟ","ﻛ","ﮐ","𝓢","⳽","ຮ","ꚃ","Ṣ","⟆","ﮑ","𝕊","𝕤","ی","ꕷ","Ｓ","Ś","ي","🇸","ى","ร","ક"],["t","𝗍","ŧ","ʈ","𝐭","𝘵","ᵗ","𝘁","ₜ","ƫ","Ʈ","𝔱","𝖙","𝕥","𝙩","Ꚍ","τ","†","𝚝","է","Ҭ","ߙ","ꚍ","𝓽","ꞎ","ϯ","Է","Ł","✝","ⱦ","𝒕","ȶ","𝑡","ե","Ե","Ꝉ","七","ቲ","ť","ţ","ｔ"],["U","𝗨","𝗎","u","ᑌ","∪","ս","𝖴","ⵡ","Ս","ᓑ","ᶸ","Ա","⋃","𝘂","υ","Մ","ᵤ","ᵁ","𝐮","ᴜ","ʋ","Ⴎ","ᵘ","µ","ᥙ","𝙐","ų","𝚞","𝙪","Ų","ʯ","⊔","𝞄","Ʋ","𝘜","𝞾","ᐡ","𝘶","ߎ","ն","𝒖","𝑢","𝖚","પ","ᥩ","𐒩","𐌵","𐒜","𝚄","ʊ","𝓾","𝓤","և","𝝒","૫","ᑘ","𝝁","ụ","𝖀","Ư","Ū","ū","𝔲","Ǔ","ᑗ","Ụ","ͧ","ᑧ","𝛍","ù","𝕌","Ũ","Ŭ","Ȗ","ᕫ","𝓊","𝔘","ũ","ᶣ","Ú","Û","ပ","ப","ሀ","ㄩ","🇺","ሁ","ύ","ປ","⊍","ป","ú","Ù","ህ","ມ","ሆ","ບ"],["𝗩","ᐯ","V","v","ⴸ","𝖵","𝗏","Ⅴ","ⅴ","∨","ᵥ","Ꮩ","ᴠ","ⱽ","𝘃","Ѵ","⋁","∀","ᵛ","ѵ","ݍ","𝝯","∇","ν","ᐁ","Ɐ","𝐕","𝚅","𝚟","𝐯","⋎","𝙑","ͮ","ߜ","۷","٧","𝙫","𝞶","ᕓ","𝘷","𝝼","𝑽","𝘝","˅","𝑉","𝜵","ᘁ","𝞩","𝛎","𝒗","𝑣","⛛","߇","𝜈","𝛖","𝝂","𝜐","ʊ","𝓿","⌵","𝝊","Ʋ","🜄","𝓥","ᜠ","Ꮴ","ᜱ","ᐺ","ᕂ","Ṿ","√","៴","✓","🇻","ύ","౮","ሆ"],["w","𝗪","𝘄","𝗐","Ԝ","𝖶","𝙒","W","ԝ","ᴡ","𝙬","ʷ","ᵂ","𝘸","Ꮃ","Ⱳ","𝘞","𝚠","ꟽ","ⱳ","𝐖","Ꮤ","𝐰","𝚆","𝑤","𝑾","𝕨","𝑊","𝒘","𝕎","Ш","Ẁ","ш","ω","𝞈","Ẃ","🝃","𝟂","⍵","ᗯ","ᐜ","𝔀","ѡ","𝓦","𝛚","ᙎ","𝝎","ധ","𝜔","Ẅ","ᙡ","ⲱ","ພ","Ⲱ","Ŵ","ᘺ","ሠ","𝝕","Ẉ","ᗵ","𝜛","ሡ","ꙍ","𝛡","ᥕ","🇼","🆆","ｗ","พ","ຟ","ώ","ฟ","ሥ","ഡ","⒲","ຜ","ຝ","ผ"],["x","Χ","х","𝝬","𝗫","Х","X","𝗑","ⅹ","ⵝ","𝖷","𝘅","Ⅹ","ˣ","χ","ᕁ","ᕽ","ⵅ","Ҳ","ₓ","ҳ","𝙓","᙮","𐌢","𐌗","𝞦","×","𝞆","᙭","ᵡ","𝚾","ᵪ","𝙭","𝐗","𝐱","𝘹","𝘟","⨯","ⴴ","𝚇","Ӿ","𝚡","𝛸","☓","𝑋","𝟀","✕","╳","𝑿","✘","𝜲","𝒙","Ӽ","✗","⨉","𝑥","𝛘","𝜒","𝝌","ⵋ","𝕏","⌧","𝔁","𐍇","𝓧","ͯ","𝕩","⧖","⛌","ᚕ","Ẍ","ẍ","⤫","𝖃","⤬","🗙","྾","ｘ","ㄨ"],["y","𝘆","У","у","𝗒","ʸ","𝙮","𝘺","ү","γ","𝞬","Ꭹ","𝚢","𝐲","ұ","𝝲","ᵧ","ᵞ","𐍅","ƴ","ɏ","𝐘","𝕪","Y","𝒀","𝑌","Υ","𝑦","𝒚","𝞤","Ⴘ","𝙔","ყ","Ꮍ","ʏ","ჸ","𐒦","𝖸","𝘠","𝗬","𝚈","Ү","𝝪","ỿ","Ⴤ","𝔂","Ⴞ","𝛄","ߌ","ץ","џ","ע","𐒋","Ỿ","უ","𝓨","Ɏ","丫","Ύ","Ý","🇾","ý","ỵ","Ÿ","ㄚ","ሃ"],["Z","z","𝗭","𝝛","𝗓","ᙆ","Ζ","ᴢ","𝖹","𝞕","ᶻ","𝙕","Ꮓ","Ⱬ","𝒁","𝜡","Ƶ","ⱬ","𝘡","𝑍","𝛧","𝚣","𝘻","𝚭","Ȥ","𝘇","ƶ","𝐙","𝐳","𝙯","𝚉","☡","Ⲍ","ᵶ","ℤ","Ɀ","ʑ","𝕫","𝒛","𐌶","ⲍ","ʐ","𝑧","Ż","Ź","ȥ","乙","🇿"],["Α","A","А","𝖠","𝝖","∆","𝗔","ᐃ","Ꭺ","Δ","𐌀","Ą","ᴬ","ⵠ","Λ","ᴀ","𝝙","ᐱ","ⴷ","ߡ","ʌ","𝘈","Å","𝝠","𝙰","𝚨","∧","𝐀","𐌡","Ѧ","𝞐","Ʌ","𝘼","𝚲","Å","⋀","ꕔ","𝐴","𝛢","𝞓","ᗅ","𝜜","𝚫","𝑨","ᗋ","Ꙙ","𝞚","𝜟","٨","۸","₳","ᴧ","𝓐","𝛬","𝜦","ѧ","𝔸","À","ᗩ","ꙙ","🜂","Á","⩜","⋏","⧍","Ã","Ⲇ","Ā","Ă","Ǎ","Ȧ","Ά","🇦","Ạ","🅰","️","Ἀ"],["B","𝖡","В","𝘉","Β","в","ᴮ","𝗕","𝝗","ʙ","Ᏼ","𐌁","Ɓ","ꕗ","𝙱","Ƀ","𝐁","𝚩","ᗷ","𝞑","𝘽","𝜝","ᗸ","𝛣","Ⲃ","𝑩","𝐵","β","ᴯ","ᴃ","ℬ","ß","Ᏸ","ᗺ","ⲃ","𝓑","𝝱","ᗹ","ẞ","𝜷","𝞫","ɮ","𝔹","𝛃","Ḃ","🅱","️","ദ","🇧"],["C","ʗ","匸"],["D","ᗞ","Ⅾ","𝖣","Ɖ","Ꭰ","𝘋","𝗗","ᴰ","ᴅ","Ð","Ɗ","Đ","𝐃","𝙳","Ɒ","ᗪ","𝘿","𝐷","𝑫","Ḑ","ⅅ","Ḍ","𝓓","ᗟ","ᗠ","𝔻","Ď","ᗫ","Ḋ","Ḏ","🇩"],["Ε","E","Е","𝖤","ⴹ","𝗘","Ꭼ","ⵟ","𝘌","ᴱ","ᴇ","𝝚","ꗋ","Ɛ","⋿","ℇ","Ę","Ꜫ","Є","ɛ","𝙴","Ȩ","ε","ᗴ","𝙀","𝚬","𝐸","𝐄","ϵ","𝞔","ꜫ","𝛦","𝑬","𝜠","𝔼","Ԑ","є","𝝴","𝞮","𝞊","Ǝ","𝟄","𝜀","𝜺","ℰ","𝛆","𝓔","∈","𝝐","ԑ","∃","ⵇ","𝛜","É","Ꮛ","Ē","𝞢","Ė","È","𝝽","ᙓ","Ê","Ĕ","Ʃ","Ѐ","Ẹ","𐒢","ᄐ","ᇀ","દ","ㅌ","트"],["𝖥","𝗙","Ϝ","F","ꜰ","ߓ","𝘍","Ƒ","₣","𝙁","ᖴ","╒","𝟊","𝙵","𝐅","𝑭","𝐹","𝔽","Ӻ","𝟋","Ŧ","𐍆","ℱ","𝓕","Ḟ","ꘘ","℉","ፑ","🇫","Ｆ"],["G","𝖦","𝘎","ɢ","Ǥ","𝗚","Ԍ","Ꮐ","Ⴚ","ᴳ","𝙶","𝙂","Ꮆ","ԍ","𝐆","𝑮","Ɠ","𝐺","Ᏻ","₲","𝔾","𝓖","ʛ","🇬","Ģ","Ġ","Ğ"],["𝗛","𝝜","Н","Η","𝖧","ᕼ","H","ʜ","н","Ꮋ","Ⲏ","𝘏","Ꜧ","𝞖","Ң","Ӈ","𝙃","𝚮","ᴴ","ᵸ","𝐇","Ⱨ","𝙷","ꖾ","ⴼ","ң","𝛨","𝐻","𝑯","𝜢","Ӊ","ⲏ","ӈ","ℍ","ỻ","ℋ","ዘ","ਮ","ꔠ","ᚌ","₶","𝓗","Ĥ","Ή","Ḣ","Ḥ","Ḫ","Ἡ","Ḩ","Ή","ῌ","Ȟ","ӊ","Ἠ","Ὴ","廾","ዞ","ዛ","ㅐ","ዙ","🇭","卄","ዚ"],["┃","I","Ι","▎","𝐥","𝐈","І","ɪ","𝖨","ⵊ","𝚰","▏","l","❙","ⵏ","ǀ","ꕯ","𝘐","▕","ߊ","ꟾ","ꞁ","|","𝜤","𝙸","ı","Ӏ","Ⅰ","ⅼ","ا","𝑰","ﺍ","⎮","𐌠","𝗜","𐌉","Ⲓ","׀","╿","ן","𝝞","ӏ","╽","𝍩","𝙄","⎜","❘","⎢","│","𐌹","𝙡","𝞘","エ","∣","𝘭","𝐼","⌶","𝛪","ⲓ","𐒃","ו","/","𝗹","৷","౹","꘡","ェ","𝕀","𐤖","⟧","𝓘","𝗅","।","丨","།","工","ㅣ","୲","ŀ","Ì","∤","ľ","忄"],["𝗝","J","Ј","ȷ","𝖩","𝐉","𝙅","⅃","ᒧ","ᴶ","⌡","Ꭻ","𝘑","ᒍ","ᴊ","⌋","ﻝ","ل","𝑱","𝙹","ﻞ","𝐽","ℐ","𝚥","ᒎ","Ɉ","ڶ","ݪ","𝓙","Ĵ","ᒏ","Ⴐ","ਹ","ᒨ","丁","၂","🇯"],["К","ĸ","𝗞","K","𝖪","κ","Κ","к","K","𝝟","Қ","Ꮶ","k","𝙆","Ҝ","𝞙","Ҡ","Ҟ","ᴋ","Ƙ","ᴷ","𝗸","қ","𝘒","₭","𝚱","𝐊","Ⲕ","ҝ","𝗄","Ԟ","𝙺","𝝹","Ꝁ","Ꝃ","Ⱪ","Ꝅ","Ϗ","Ќ","𝐾","Ķ","𝛫","ќ","ҡ","Ḱ","ḳ","Ḵ","𝞳","Ǩ","Ḳ","ḵ","ԟ","ķ","ꗪ","𝙠","𝑲","ⱪ","𝛋","𝜥","ꝁ","𝘬","ƙ","ҟ","𝜿","𝕂","ⲕ","ꝃ","ꝅ","𝚔","𝜅","ᵏ","𝕜","𝓚","ₖ","🇰"],["┖","┗","L","┕","ᒪ","𝖫","ʟ","Ⅼ","└","𝗟","Լ","Ꝉ","𝘓","ւ","ᒻ","Ꮮ","╘","ᴸ","Ƚ","˪","꜖","∟","𝙇","ᶫ","𝐋","ᥨ","𝙻","𝑳","𝐿","ᒫ","Ỻ","𝕃","ℒ","⌊","Ĺ","𝓛","ட","Ł","⎿","╚","Ḷ","Ļ","ᒶ","ᢺ","Ľ","ᒷ","ㄴ","乚","🇱","ㄥ","Ŀ"],["М","Μ","𝗠","𝖬","м","Ⅿ","M","𝝡","𝘔","Ɱ","ᴍ","ᴹ","𝚳","Ӎ","𝐌","Ꮇ","ʍ","𝙈","𝞛","𝙼","𝕄","ℳ","𐌑","𝑴","𝛭","𝑀","𝜧","Ϻ","ϻ","Ꙧ","ӎ","ᗰ","ᙏ","ᙢ","𝓜","ന","♏","ო","ꙧ","൩","ጠ","ᘻ","ᶬ","Ṃ","൱","ṃ","🇲","ጦ","ྊ","ღ"],["N","ɴ","𝝢","𝖭","𝗡","Ν","Ɲ","𝘕","Ꞑ","ᶰ","ᴺ","Ⲛ","𝚴","𝙽","𝐍","𝞜","𐌽","𝙉","ⲛ","𝜨","𝛮","𝑵","𝑁","𝝥","Ṇ","ℕ","п","Ń","И","𝓝","ℿ","Ņ","Ƞ","Ṋ","Ñ","Ň","ղ","ח","Ṅ","Ｎ","🇳"],["О","O","Ο","𝖮","о","ο","Օ","0","o","ⵔ","𝘖","𝗈","໐","ₒ","ᴼ","Ơ","߀","𝟢","օ","𝝤","𝐎","𝗢","𝚶","⭕","⁰","Ⲟ","⭘","⚪","ᴏ","𝟬","𝙊","ߋ","○","𝞞","𝙾","θ","❍","𐒠","◯","٥","𝟶","௦","𝙤","𝝾","Ѻ","𝗼","𝞸","𝚘","𝜪","𝑶","𝘰","ⲟ","𐒆","𝛰","𝛐","𝟎","𝑂","⚬","੦","𝐨","σ","ഠ","𝝄","𝝧","𝑜","𝜊","𝞱","𝓞","ℴ","⬯","๐","𝛳","𝜃","ʘ","Ө","ⵀ","𝛉","𝞡","Ꙩ","Θ","𝜽","ⵙ","𝝷","℺","Ό","⚈","𝜭","ѻ","Ó","Ȯ","ϴ","Ò","Õ","Ō","Ǒ","ɵ","೦","⊙","◎","ဝ","၀","〇","ㅇ","０","౦","🔵","☉","ዐ","⚫","🔴","Ø","ဓ","ዑ","⊝","💿","ଠ"],["Ρ","Р","P","𝖯","𝗣","ᑭ","𝘗","ᴾ","Ꝑ","Ᵽ","𝝦","Ƥ","ᴘ","Ꮲ","⍴","ᴩ","𝗉","𝐏","𝚸","ρ","𝞠","𝙋","𝗽","𝐩","𝙿","𝞀","Ҏ","𝜬","𝑷","𝛲","Ⲣ","𝛒","𝑃","𝞺","ƿ","þ","𝓟","ℙ","Ꝓ","Ꭾ","Ῥ","ⲣ","ᑶ","𝕡","ᑮ","Ṗ","Ṕ","ᑷ","ꝓ","ᒆ","🇵","🅿","️"],["Q","Ԛ","𝖰","Ⴍ","𝗤","Ꝗ","Ⴓ","Ϙ","𝘘","𝐐","Ɋ","ϙ","𝙌","Ǫ","ǫ","ⵕ","𝚀","𝑸","𝑄","Ǭ","ℚ","🇶"],["R","𝗥","𝖱","ʀ","𝙍","Ɍ","𝘙","Ꭱ","Ɽ","𝐑","Ʀ","ᴿ","Ꮢ","𝚁","ᖇ","𝑅","℟","𝑹","ℛ","ℝ","𝓡","℞","🝈","Ŕ","ℜ","🇷","®","️"],["Ѕ","Ⴝ","𝖲","s","ѕ","𝗌","Տ","S","ꜱ","𝘚","𝗦","Ꮪ","𝘴","𝚂","Ş","𝐒","ꕶ","Ꭶ","𝙎","Ꚃ","𐍃","𝐬","𝑺","𝚜","Ꮥ","𐒖","𝘀","𝑆","ട","𐒡","𝙨","ડ","ಽ","ऽ","ꗟ","ş","ʂ","ຣ","𝓢","ᵴ","𝒔","𝑠","ઽ","𝕊","ﻛ","ک","ﮐ","ꚃ","⟆","ᔑ","𝕤","ຮ","ℐ","ꗏ","ꕷ","Ｓ","Ś","ഽ","🇸","ક","ร","Š","Ŝ","ś"],["T","Т","Τ","┰","┬","т","Ƭ","𝖳","Ţ","Ꭲ","┯","┳","𝍮","ᵀ","Ʈ","Ҭ","𝗧","ҭ","𝝩","ߠ","ᴛ","Ⲧ","🝨","𝘛","⊤","ꔋ","𝐓","𝚻","𝚃","╥","⟙","𝑻","𝞣","𝙏","Ͳ","𝑇","𝜯","𝞃","𝛵","𝞽","†","Ṭ","𐍄","Ț","⊺","ⲧ","ͳ","⏉","𝕋","ፐ","𝍯","╤","╦","Ṱ","₸","Ṫ","⫪","Ṯ","ㅜ","ㄒ","๋","🇹","Ť","丅","〒"],["U","𝗨","∐","ᑌ","Ս","Մ","∪","𝖴","⋃","Ⴎ","υ","ⵡ","ᴜ","ᵁ","𝘜","ʋ","Ų","Ʋ","ᙀ","Ա","𝙐","𝐔","𝚄","Ư","⨿","ᕟ","⊔","ᥩ","𝞄","𝑼","𝑈","𝞾","ᥙ","𐒩","ᕞ","ʯ","𝕌","կ","ߎ","ų","𝓤","Ŭ","Ǔ","ມ","Ū","Ụ","Û","Ũ","ᑗ","ᑘ","և","ᑧ","Ù","ப","ບ","Ú","ᕫ","Ȗ","𐌵","ሀ","ㄩ","🇺","ሁ","⊍","ປ","บ","ั","ป","⋓","Ü","ሆ","Ű","Ů","ϋ"],["ᐯ","V","𝖵","ⴸ","𝗩","Ⅴ","v","Ꮩ","𝗏","∨","ⅴ","⋁","ᴠ","Ѵ","∀","ᐁ","∇","Ɐ","𝚅","ν","ߜ","ѵ","𝐕","𝝯","ᕓ","۷","𝘃","ݍ","٧","𝙑","⋎","𝘝","𝑉","𝑽","Ꮴ","⛛","𝛎","߇","𝑣","𝜈","ᜠ","𝝂","˅","🜄","𝓥","Ṿ","ṿ","Ⱌ","𐌖","𝕍","𝜐","ᜱ","⧨","ᐺ","𐌞","ᐻ","ᕟ","√","𝝊","🝣","ʋ","🇻"],["w","W","Ԝ","𝗪","𝗐","𝖶","ԝ","𝘄","ᴡ","Ꮃ","Ⱳ","ᵂ","𝙒","𝘸","𝘞","ꟽ","𝚆","𝙬","Ꮤ","𝐖","ⱳ","𝑾","𝑊","𝐰","𝕨","𝕎","Ш","Ẁ","Ẃ","𝑤","Ẅ","🝃","ᗯ","ш","ω","Ẇ","ᙎ","Ɯ","⍵","𝓦","Щ","Ŵ","ᙡ","₩","ѡ","⨈","𝞈","𝛚","ພ","𝜔","Ⲱ","ധ","𝝎","ⲱ","Ẉ","ᥕ","⟒","🆆","🇼","ሠ","ሡ","ய","ｗ","พ","ຟ","ώ","ฟ","⒲","ഡ","ຜ"],["x","Χ","X","Х","х","ⵝ","𝗫","𝝬","𝖷","𝗑","Ⅹ","χ","Ҳ","ⵅ","ⅹ","𐌗","𐌢","ᕁ","ҳ","╳","𝘟","ˣ","𝙓","𝞦","𝞆","᙭","ⴴ","𝘅","ᵡ","×","☓","𝚾","𝚇","Ӿ","𝐗","𝛸","𝑋","Ӽ","𝚡","𝐱","𝘹","𝙭","𝟀","⨯","𝑿","𝜲","✘","𝛘","✕","𝜒","❌","𝝌","✗","✖","ⵋ","ӿ","𝕏","𝑥","⨉","𝓧","ᚕ","Ẋ","ẋ","⌧","𝕩","Ⲭ","ӽ","Ẍ","⛌","⤬","✖","️","🇽","乂","🗙","྾","ｘ","ㄨ"],["𝝲","Y","ʏ","𝝪","𝖸","Υ","Ү","ү","𝗬","ᵞ","𝞤","𝞬","𝙔","𝐘","𐍅","𝘠","𝚈","ұ","𝒀","Ұ","Ⲩ","Ƴ","Ɏ","𝑌","𝚼","ߌ","ϒ","ⲩ","Ⴤ","Ⴘ","ყ","𝕐","ⵖ","Ỵ","Ȳ","Ŷ","Ύ","Ỳ","Ῡ","Ý","Ⴗ","Ὺ","Ύ","Ὑ","Ῠ","丫","🇾","Ÿ","￥","ㄚ"],["Z","z","𝗓","Ζ","𝖹","𝝛","𝗭","Ꮓ","Ƶ","Ⱬ","𝜡","𝒁","𝘡","𝑍","𝛧","Ȥ","𝙕","𝞕","ⱬ","𝚭","𝐙","ƶ","Ⲍ","𝘇","Ɀ","𝙯","ℤ","☡","𝕫","ʐ","ᵶ","𝒛","ⲍ","𝑧","𐌶","ɀ","ȥ","Ž","Ż","Ź","乙","🇿","之","🆉"],[",","‚","̹","̦","˒","❟","⸴","̩","⸒","̗","ˏ","٫","̡","ܼ","៸","ر"],["˃","ᐳ",">","≻","ᗆ","ᗒ","⦠","ᐅ","ᗌ","ᗓ","›","ᐷ","ᑁ","᚛","⪫","ᗘ","ᑀ","ᐴ","❯","❱","❭","⧽","⋗","〉","ᗙ","ᐶ","⟩","⦔","⩾","⨠","⋟","⍩","≥","〉","》","＞"],["߲",".","܂","݂","ܼ","ٜ","ᨘ","․","̣","⠠","⡀","⢀","ׅ","ִ","̥","̻","ⴰ","ֽ","。","．"],["?","❓","‽","␦","ᕉ","Ɂ","؟","⸮","ɂ","❔","ॽ","ᕈ","？"],["/","∕","⧸","╱","⁄","̷","̸","𝘭","𝞘","𐒃","᜵","⸝","⟋","𝙡"],[",","‚","̹","͵","˒","̦","⸴","❟","̩","⸒","̗","ˌ","ˏ","֥"],["ļ","ǃ","!","ǃ","ⵑ","ᴉ","Ị","ﺇ","ḷ","ꜝ","ᵎ","إ","יִ","❗","ꜞ","ﺈ","ٳ","❕","！","᥄"]];




function replaceText(){ 

    let text = document.getElementById('textarea');

    console.log(text.textContent);
    console.log(text.textContent.length);

    let newString = "";
    
    for (let i=0; i<text.textContent.length; i++) {
      
      let c = text.textContent.charAt(i);
      if (c === ' ') newString += ' ';
      else if (c === '\n') newString += '\n';
      else {
        let cp = text.textContent.codePointAt(i);
        for (let j=0; j<Fonts.length; j++) {
          let currentFont = Fonts[j];

          //if (currentFont.includes(c)) {
          for (let k=0; k<currentFont.length; k++) {
             // pick a random one
            if (currentFont[k].codePointAt(0) === cp) {
              let randomIndex = Math.floor(Math.random()*currentFont.length);
              let newChar = currentFont[randomIndex];
              if (newChar === undefined) {
                console.log(randomIndex);
                console.log(text.textContent.charAt(i));
              }
              newString += newChar;
              j = Fonts.length;
            }
          }
        }
      }
    }

    document.getElementById("textarea").textContent = newString;

}

function replaceTitle(){ 

    let title = document.getElementById('shuffle-title');

    console.log(title.textContent);
    console.log(title.textContent.length);

    let newString = "";
    
    for (let i=0; i<title.textContent.length; i++) {
      
      let c = title.textContent.charAt(i);
      if (c === ' ') newString += ' ';
      else if (c === '\n') newString += '\n';
      else {
        let cp = title.textContent.codePointAt(i);
        for (let j=0; j<Fonts.length; j++) {
          let currentFont = Fonts[j];

          //if (currentFont.includes(c)) {
          for (let k=0; k<currentFont.length; k++) {
             // pick a random one
            if (currentFont[k].codePointAt(0) === cp) {
              let randomIndex = Math.floor(Math.random()*currentFont.length);
              let newChar = currentFont[randomIndex];
              if (newChar === undefined) {
                console.log(randomIndex);
                console.log(title.textContent.charAt(i));
              }
              newString += newChar;
              j = Fonts.length;
            }
          }
        }
      }
    }

    document.getElementById("shuffle-title").textContent = newString;

}



setInterval(function(){

  replaceTitle();


}, 100);
